# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

#!/usr/bin/env python3

masks = {
    "0": "0.0.0.0",
    "1": "128.0.0.0",
    "2": "192.0.0.0",
    "3": "224.0.0.0",
    "4": "240.0.0.0",
    "5": "248.0.0.0",
    "6": "252.0.0.0",
    "7": "254.0.0.0",
    "8": "255.0.0.0",
    "9": "255.128.0.0",
    "10": "255.192.0.0",
    "11": "255.224.0.0",
    "12": "255.240.0.0",
    "13": "255.248.0.0",
    "14": "255.252.0.0",
    "15": "255.254.0.0",
    "16": "255.255.0.0",
    "17": "255.255.128.0",
    "18": "255.255.192.0",
    "19": "255.255.224.0",
    "20": "255.255.240.0",
    "21": "255.255.248.0",
    "22": "255.255.252.0",
    "23": "255.255.254.0",
    "24": "255.255.255.0",
    "25": "255.255.255.128",
    "26": "255.255.255.192",
    "27": "255.255.255.224",
    "28": "255.255.255.240",
    "29": "255.255.255.248",
    "30": "255.255.255.252",
    "31": "255.255.255.254",
    "32": "255.255.255.255"
}

format = input('Введите IP-сеть в формате (10.1.1.0/24):  ')

ip, mask = format.split('/')
ip1,ip2,ip3,ip4 = ip.split('.')

print('Network:')
print("{:8} {:8} {:8} {:8}".format(ip1,ip2,ip3,ip4))
print("{:08b} {:08b} {:08b} {:08b}".format(int(ip1),int(ip2),int(ip3),int(ip4)))

print('\n')

print('Mask')
print('/' + mask)

mask = masks[mask]
mask1,mask2,mask3,mask4 = mask.split('.')

print("{:8} {:8} {:8} {:8}".format(mask1,mask2,mask3,mask4))
print("{:08b} {:08b} {:08b} {:08b}".format(int(mask1),int(mask2),int(mask3),int(mask4)))
'''
Введите IP-сеть в формате (10.1.1.0/24):  1.1.1.0/24
Network:
1        1        1        0       
00000001 00000001 00000001 00000000


Mask
/24
255      255      255      0       
11111111 11111111 11111111 00000000
'''